maxboss10086/max_dsp/max/F28388D/clb_pwm/device/driverlib/inc/hw_sysctl.h
//###########################################################################
//
// FILE:    hw_sysctl.h
//
// TITLE:   Definitions for the SYSCTL registers.
//
//###########################################################################
// $TI Release: F2838x Support Library v3.02.00.00 $
// $Release Date: Tue May 26 17:21:56 IST 2020 $
// $Copyright:
// Copyright (C) 2020 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_SYSCTL_H
#define HW_SYSCTL_H

//*****************************************************************************
//
// The following are defines for the SYSCTL register offsets
//
//*****************************************************************************
#define SYSCTL_O_CLKSEM           0x0U         // Clock Control Semaphore
                                               // Register
#define SYSCTL_O_CLKCFGLOCK1      0x2U         // Lock bit for CLKCFG registers
#define SYSCTL_O_CLKSRCCTL1       0x8U         // Clock Source Control
                                               // register-1
#define SYSCTL_O_CLKSRCCTL2       0xAU         // Clock Source Control
                                               // register-2
#define SYSCTL_O_CLKSRCCTL3       0xCU         // Clock Source Control
                                               // register-3
#define SYSCTL_O_SYSPLLCTL1       0xEU         // SYSPLL Control register-1
#define SYSCTL_O_SYSPLLMULT       0x14U        // SYSPLL Multiplier register
#define SYSCTL_O_SYSPLLSTS        0x16U        // SYSPLL Status register
#define SYSCTL_O_AUXPLLCTL1       0x18U        // AUXPLL Control register-1
#define SYSCTL_O_AUXPLLMULT       0x1EU        // AUXPLL Multiplier register
#define SYSCTL_O_AUXPLLSTS        0x20U        // AUXPLL Status register
#define SYSCTL_O_SYSCLKDIVSEL     0x22U        // System Clock Divider Select
                                               // register
#define SYSCTL_O_AUXCLKDIVSEL     0x24U        // Auxillary Clock Divider
                                               // Select register
#define SYSCTL_O_PERCLKDIVSEL     0x26U        // Peripheral Clock Divider
                                               // Selet register
#define SYSCTL_O_XCLKOUTDIVSEL    0x28U        // XCLKOUT Divider Select
                                               // register
#define SYSCTL_O_CLBCLKCTL        0x2AU        // CLB Clocking Control Register
#define SYSCTL_O_LOSPCP           0x2CU        // Low Speed Clock Source
                                               // Prescalar
#define SYSCTL_O_MCDCR            0x2EU        // Missing Clock Detect Control
                                               // Register
#define SYSCTL_O_X1CNT            0x30U        // 10-bit Counter on X1 Clock
#define SYSCTL_O_XTALCR           0x32U        // XTAL Control Register
#define SYSCTL_O_ETHERCATCLKCTL   0x36U        // ETHERCATCLKCTL
#define SYSCTL_O_CMCLKCTL         0x38U        // CMCLKCTL
#define SYSCTL_O_CPUSYSLOCK1      0x0U         // Lock bit for CPUSYS registers
#define SYSCTL_O_CPUSYSLOCK2      0x2U         // Lock bit for CPUSYS registers
#define SYSCTL_O_PIEVERRADDR      0xAU         // PIE Vector Fetch Error
                                               // Address register
#define SYSCTL_O_PCLKCR0          0x22U        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR1          0x24U        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR2          0x26U        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR3          0x28U        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR4          0x2AU        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR6          0x2EU        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR7          0x30U        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR8          0x32U        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR9          0x34U        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR10         0x36U        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR11         0x38U        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR13         0x3CU        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR14         0x3EU        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR16         0x42U        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR17         0x44U        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR18         0x46U        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR20         0x4AU        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR21         0x4CU        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR22         0x4EU        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_PCLKCR23         0x50U        // Peripheral Clock Gating
                                               // Registers
#define SYSCTL_O_SIMRESET         0x70U        // Simulated Reset Register
#define SYSCTL_O_LPMCR            0x76U        // LPM Control Register
#define SYSCTL_O_GPIOLPMSEL0      0x78U        // GPIO LPM Wakeup select
                                               // registers
#define SYSCTL_O_GPIOLPMSEL1      0x7AU        // GPIO LPM Wakeup select
                                               // registers
#define SYSCTL_O_TMR2CLKCTL       0x7CU        // Timer2 Clock Measurement
                                               // functionality control register
#define SYSCTL_O_RESCCLR          0x7EU        // Reset Cause Clear Register
#define SYSCTL_O_RESC             0x80U        // Reset Cause register
#define SYSCTL_O_CLA1TASKSRCSELLOCK  0x0U         // CLA1 Task Trigger Source
                                               // Select Lock Register
#define SYSCTL_O_DMACHSRCSELLOCK  0x4U         // DMA Channel Triger Source
                                               // Select Lock Register
#define SYSCTL_O_CLA1TASKSRCSEL1  0x6U         // CLA1 Task Trigger Source
                                               // Select Register-1
#define SYSCTL_O_CLA1TASKSRCSEL2  0x8U         // CLA1 Task Trigger Source
                                               // Select Register-2
#define SYSCTL_O_DMACHSRCSEL1     0x16U        // DMA Channel Trigger Source
                                               // Select Register-1
#define SYSCTL_O_DMACHSRCSEL2     0x18U        // DMA Channel Trigger Source
                                               // Select Register-2
#define SYSCTL_O_DEVCFGLOCK1      0x0U         // Lock bit for DEVCFG registers
#define SYSCTL_O_PARTIDL          0x8U         // Lower 32-bit of Device PART
                                               // Identification Number
#define SYSCTL_O_PARTIDH          0xAU         // Upper 32-bit of Device PART
                                               // Identification Number
#define SYSCTL_O_REVID            0xCU         // Device Revision Number
#define SYSCTL_O_PERCNF1          0x60U        // Peripheral Configuration
                                               // register
#define SYSCTL_O_FUSEERR          0x74U        // e-Fuse error Status register
#define SYSCTL_O_SOFTPRES0        0x82U        // Processing Block Software
                                               // Reset register
#define SYSCTL_O_SOFTPRES1        0x84U        // EMIF Software Reset register
#define SYSCTL_O_SOFTPRES2        0x86U        // Peripheral Software Reset
                                               // register
#define SYSCTL_O_SOFTPRES3        0x88U        // Peripheral Software Reset
                                               // register
#define SYSCTL_O_SOFTPRES4        0x8AU        // Peripheral Software Reset
                                               // register
#define SYSCTL_O_SOFTPRES6        0x8EU        // Peripheral Software Reset
                                               // register
#define SYSCTL_O_SOFTPRES7        0x90U        // Peripheral Software Reset
                                               // register
#define SYSCTL_O_SOFTPRES8        0x92U        // Peripheral Software Reset
                                               // register
#define SYSCTL_O_SOFTPRES9        0x94U        // Peripheral Software Reset
                                               // register
#define SYSCTL_O_SOFTPRES10       0x96U        // Peripheral Software Reset
                                               // register
#define SYSCTL_O_SOFTPRES11       0x98U        // Peripheral Software Reset
                                               // register
#define SYSCTL_O_SOFTPRES13       0x9CU        // Peripheral Software Reset
                                               // register
#define SYSCTL_O_SOFTPRES14       0x9EU        // Peripheral Software Reset
                                               // register
#define SYSCTL_O_SOFTPRES16       0xA2U        // Peripheral Software Reset
                                               // register
#define SYSCTL_O_SOFTPRES17       0xA4U        // Reserved Peripheral Software
                                               // Reset register
#define SYSCTL_O_SOFTPRES18       0xA6U        // Reserved Peripheral Software
                                               // Reset register
#define SYSCTL_O_SOFTPRES20       0xAAU        // Peripheral Software Reset
                                               // register
#define SYSCTL_O_SOFTPRES21       0xACU        // Peripheral Software Reset
                                               // register
#define SYSCTL_O_SOFTPRES23       0xB0U        // Peripheral Software Reset
                                               // register
#define SYSCTL_O_CPUSEL0          0xD6U        // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPUSEL1          0xD8U        // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPUSEL2          0xDAU        // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPUSEL4          0xDEU        // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPUSEL5          0xE0U        // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPUSEL6          0xE2U        // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPUSEL7          0xE4U        // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPUSEL8          0xE6U        // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPUSEL9          0xE8U        // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPUSEL11         0xECU        // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPUSEL12         0xEEU        // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPUSEL14         0xF2U        // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPUSEL15         0xF4U        // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPUSEL16         0xF6U        // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPUSEL18         0xFAU        // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPUSEL25         0x108U       // CPU Select register for
                                               // common peripherals
#define SYSCTL_O_CPU2RESCTL       0x122U       // CPU2 Reset Control Register
#define SYSCTL_O_RSTSTAT          0x124U       // Reset Status register for
                                               // secondary C28x CPUs
#define SYSCTL_O_LPMSTAT          0x125U       // LPM Status Register for
                                               // secondary C28x CPUs
#define SYSCTL_O_BANKSEL          0x184U       // Configures the bank to
                                               // programmed by CPU1.
#define SYSCTL_O_USBTYPE          0x19AU       // Configures USB Type for the
                                               // device
#define SYSCTL_O_ECAPTYPE         0x19BU       // Configures ECAP Type for the
                                               // device
#define SYSCTL_O_SDFMTYPE         0x19CU       // Configures SDFM Type for the
                                               // device
#define SYSCTL_O_MEMMAPTYPE       0x19EU       // Configures Memory Map Type
                                               // for the device
#define SYSCTL_O_ADCA_AC          0x0U         // ADCA Master Access Control
                                               // Register
#define SYSCTL_O_ADCB_AC          0x2U         // ADCB Master Access Control
                                               // Register
#define SYSCTL_O_ADCC_AC          0x4U         // ADCC Master Access Control
                                               // Register
#define SYSCTL_O_ADCD_AC          0x6U         // ADCD Master Access Control
                                               // Register
#define SYSCTL_O_CMPSS1_AC        0x10U        // CMPSS1 Master Access Control
                                               // Register
#define SYSCTL_O_CMPSS2_AC        0x12U        // CMPSS2 Master Access Control
                                               // Register
#define SYSCTL_O_CMPSS3_AC        0x14U        // CMPSS3 Master Access Control
                                               // Register
#define SYSCTL_O_CMPSS4_AC        0x16U        // CMPSS4 Master Access Control
                                               // Register
#define SYSCTL_O_CMPSS5_AC        0x18U        // CMPSS5 Master Access Control
                                               // Register
#define SYSCTL_O_CMPSS6_AC        0x1AU        // CMPSS6 Master Access Control
                                               // Register
#define SYSCTL_O_CMPSS7_AC        0x1CU        // CMPSS7 Master Access Control
                                               // Register
#define SYSCTL_O_CMPSS8_AC        0x1EU        // CMPSS8 Master Access Control
                                               // Register
#define SYSCTL_O_DACA_AC          0x28U        // DACA Master Access Control
                                               // Register
#define SYSCTL_O_DACB_AC          0x2AU        // DACB Master Access Control
                                               // Register
#define SYSCTL_O_DACC_AC          0x2CU        // DACC Master Access Control
                                               // Register
#define SYSCTL_O_EPWM1_AC         0x48U        // EPWM1 Master Access Control
                                               // Register
#define SYSCTL_O_EPWM2_AC         0x4AU        // EPWM2 Master Access Control
                                               // Register
#define SYSCTL_O_EPWM3_AC         0x4CU        // EPWM3 Master Access Control
                                               // Register
#define SYSCTL_O_EPWM4_AC         0x4EU        // EPWM4 Master Access Control
                                               // Register
#define SYSCTL_O_EPWM5_AC         0x50U        // EPWM5 Master Access Control
                                               // Register
#define SYSCTL_O_EPWM6_AC         0x52U        // EPWM6 Master Access Control
                                               // Register
#define SYSCTL_O_EPWM7_AC         0x54U        // EPWM7 Master Access Control
                                               // Register
#define SYSCTL_O_EPWM8_AC         0x56U        // EPWM8 Master Access Control
                                               // Register
#define SYSCTL_O_EPWM9_AC         0x58U        // EPWM9 Master Access Control
                                               // Register
#define SYSCTL_O_EPWM10_AC        0x5AU        // EPWM10 Master Access Control
                                               // Register
#define SYSCTL_O_EPWM11_AC        0x5CU        // EPWM11 Master Access Control
                                               // Register
#define SYSCTL_O_EPWM12_AC        0x5EU        // EPWM12 Master Access Control
                                               // Register
#define SYSCTL_O_EPWM13_AC        0x60U        // EPWM13 Master Access Control
                                               // Register
#define SYSCTL_O_EPWM14_AC        0x62U        // EPWM14 Master Access Control
                                               // Register
#define SYSCTL_O_EPWM15_AC        0x64U        // EPWM15 Master Access Control
                                               // Register
#define SYSCTL_O_EPWM16_AC        0x66U        // EPWM16 Master Access Control
                                               // Register
#define SYSCTL_O_EQEP1_AC         0x70U        // EQEP1 Master Access Control
                                               // Register
#define SYSCTL_O_EQEP2_AC         0x72U        // EQEP2 Master Access Control
                                               // Register
#define SYSCTL_O_EQEP3_AC         0x74U        // EQEP3 Master Access Control
                                               // Register
#define SYSCTL_O_ECAP1_AC         0x80U        // ECAP1 Master Access Control
                                               // Register
#define SYSCTL_O_ECAP2_AC         0x82U        // ECAP2 Master Access Control
                                               // Register
#define SYSCTL_O_ECAP3_AC         0x84U        // ECAP3 Master Access Control
                                               // Register
#define SYSCTL_O_ECAP4_AC         0x86U        // ECAP4 Master Access Control
                                               // Register
#define SYSCTL_O_ECAP5_AC         0x88U        // ECAP5 Master Access Control
                                               // Register
#define SYSCTL_O_ECAP6_AC         0x8AU        // ECAP6 Master Access Control
                                               // Register
#define SYSCTL_O_ECAP7_AC         0x8CU        // ECAP7 Master Access Control
                                               // Register
#define SYSCTL_O_SDFM1_AC         0xA8U        // SDFM1 Master Access Control
                                               // Register
#define SYSCTL_O_SDFM2_AC         0xAAU        // SDFM2 Master Access Control
                                               // Register
#define SYSCTL_O_CLB1_AC          0xB0U        // CLB1 Master Access Control
                                               // Register
#define SYSCTL_O_CLB2_AC          0xB2U        // CLB2 Master Access Control
                                               // Register
#define SYSCTL_O_CLB3_AC          0xB4U        // CLB3 Master Access Control
                                               // Register
#define SYSCTL_O_CLB4_AC          0xB6U        // CLB4 Master Access Control
                                               // Register
#define SYSCTL_O_CLB5_AC          0xB8U        // CLB5 Master Access Control
                                               // Register
#define SYSCTL_O_CLB6_AC          0xBAU        // CLB6 Master Access Control
                                               // Register
#define SYSCTL_O_CLB7_AC          0xBCU        // CLB7 Master Access Control
                                               // Register
#define SYSCTL_O_CLB8_AC          0xBEU        // CLB8 Master Access Control
                                               // Register                                               
#define SYSCTL_O_SPIA_AC          0x110U       // SPIA Master Access Control
                                               // Register
#define SYSCTL_O_SPIB_AC          0x112U       // SPIB Master Access Control
                                               // Register
#define SYSCTL_O_SPIC_AC          0x114U       // SPIC Master Access Control
                                               // Register
#define SYSCTL_O_SPID_AC          0x116U       // SPID Master Access Control
                                               // Register
#define SYSCTL_O_PMBUS_A_AC       0x130U       // PMBUSA Master Access Control
                                               // Register
#define SYSCTL_O_CAN_A_AC         0x140U       // CAN_A Master Access Control
                                               // Register
#define SYSCTL_O_CAN_B_AC         0x142U       // CAN_B Master Access Control
                                               // Register
#define SYSCTL_O_MCBSPA_AC        0x150U       // MCBSPA Master Access Control
                                               // Register
#define SYSCTL_O_MCBSPB_AC        0x152U       // MCBSPB Master Access Control
                                               // Register
