maxboss10086/max_dsp/max/F28388D/clb_pwm/device/driverlib/inc/hw_sysctl.h
#define SYSCTL_O_USBA_AC          0x180U       // USBA Master Access Control
                                               // Register
#define SYSCTL_O_HRPWM_AC         0x1A8U       // HRPWM Master Access Control
                                               // Register
#define SYSCTL_O_ETHERCAT_AC      0x1AAU       // ETHERCAT Master Access
                                               // Control Register
#define SYSCTL_O_FSIATX_AC        0x1B0U       // FSIATX Master Access Control
                                               // Register
#define SYSCTL_O_FSIARX_AC        0x1B2U       // FSIARX Master Access Control
                                               // Register
#define SYSCTL_O_FSIBTX_AC        0x1B4U       // FSIBTX Master Access Control
                                               // Register
#define SYSCTL_O_FSIBRX_AC        0x1B6U       // FSIBRX Master Access Control
                                               // Register
#define SYSCTL_O_FSICRX_AC        0x1BAU       // FSICRX Master Access Control
                                               // Register
#define SYSCTL_O_FSIDRX_AC        0x1BEU       // FSIDRX Master Access Control
                                               // Register
#define SYSCTL_O_FSIERX_AC        0x1C2U       // FSIERX Master Access Control
                                               // Register
#define SYSCTL_O_FSIFRX_AC        0x1C6U       // FSIFRX Master Access Control
                                               // Register
#define SYSCTL_O_FSIGRX_AC        0x1CAU       // FSIGRX Master Access Control
                                               // Register
#define SYSCTL_O_FSIHRX_AC        0x1CEU       // FSIHRX Master Access Control
                                               // Register
#define SYSCTL_O_PERIPH_AC_LOCK   0x1FEU       // Lock Register to stop Write
                                               // access to peripheral Access
                                               // register.
#define SYSCTL_O_CMRESCTL         0x0U         // CM Reset Control Register
#define SYSCTL_O_CMTOCPU1NMICTL   0x2U         // CM To CPU1 NMI Control
                                               // register
#define SYSCTL_O_CMTOCPU1INTCTL   0x4U         // CM To CPU1 interrupt Control
                                               // register
#define SYSCTL_O_PALLOCATE0       0x20U        // CM Peripheral Allocation
                                               // Register.
#define SYSCTL_O_CM_CONF_REGS_LOCK  0x3FEU       // CM Configuration Registers
                                               // Lock
#define SYSCTL_O_CM_STATUS_INT_FLG  0x0U         // Status of interrupts due to
                                               // multiple sources of Cortex-M4
                                               // reset.
#define SYSCTL_O_CM_STATUS_INT_CLR  0x2U         // CM_STATUS_INT_FLG clear
                                               // register
#define SYSCTL_O_CM_STATUS_INT_SET  0x4U         // CM_STATUS_INT_FLG set
                                               // register
#define SYSCTL_O_CM_STATUS_MASK   0x6U         // CM_STATUS_MASK register
#define SYSCTL_O_SYS_ERR_INT_FLG  0x10U        // Status of interrupts due to
                                               // multiple different errors in
                                               // the system.
#define SYSCTL_O_SYS_ERR_INT_CLR  0x12U        // SYS_ERR_INT_FLG clear
                                               // register
#define SYSCTL_O_SYS_ERR_INT_SET  0x14U        // SYS_ERR_INT_FLG set register
#define SYSCTL_O_SYS_ERR_MASK     0x16U        // SYS_ERR_MASK register
#define SYSCTL_O_SYNCSELECT       0x0U         // Sync Input and Output Select
                                               // Register
#define SYSCTL_O_ADCSOCOUTSELECT  0x2U         // External ADC (Off Chip) SOC
                                               // Select Register
#define SYSCTL_O_SYNCSOCLOCK      0x4U         // SYNCSEL and EXTADCSOC Select
                                               // Lock register

//*****************************************************************************
//
// The following are defines for the bit fields in the CLKSEM register
//
//*****************************************************************************
#define SYSCTL_CLKSEM_SEM_S       0U
#define SYSCTL_CLKSEM_SEM_M       0x3U         // Semaphore for CLKCFG
                                               // Ownership by CPU1 or CPU2
#define SYSCTL_CLKSEM_KEY_S       16U
#define SYSCTL_CLKSEM_KEY_M       0xFFFF0000U  // Key Qualifier for writes to
                                               // this register

//*****************************************************************************
//
// The following are defines for the bit fields in the CLKCFGLOCK1 register
//
//*****************************************************************************
#define SYSCTL_CLKCFGLOCK1_CLKSRCCTL1  0x1U         // Lock bit for CLKSRCCTL1
                                               // register
#define SYSCTL_CLKCFGLOCK1_CLKSRCCTL2  0x2U         // Lock bit for CLKSRCCTL2
                                               // register
#define SYSCTL_CLKCFGLOCK1_CLKSRCCTL3  0x4U         // Lock bit for CLKSRCCTL3
                                               // register
#define SYSCTL_CLKCFGLOCK1_SYSPLLCTL1  0x8U         // Lock bit for SYSPLLCTL1
                                               // register
#define SYSCTL_CLKCFGLOCK1_SYSPLLCTL2  0x10U        // Lock bit for SYSPLLCTL2
                                               // register
#define SYSCTL_CLKCFGLOCK1_SYSPLLCTL3  0x20U        // Lock bit for SYSPLLCTL3
                                               // register
#define SYSCTL_CLKCFGLOCK1_SYSPLLMULT  0x40U        // Lock bit for SYSPLLMULT
                                               // register
#define SYSCTL_CLKCFGLOCK1_AUXPLLCTL1  0x80U        // Lock bit for AUXPLLCTL1
                                               // register
#define SYSCTL_CLKCFGLOCK1_AUXPLLMULT  0x400U       // Lock bit for AUXPLLMULT
                                               // register
#define SYSCTL_CLKCFGLOCK1_SYSCLKDIVSEL  0x800U       // Lock bit for SYSCLKDIVSEL
                                               // register
#define SYSCTL_CLKCFGLOCK1_AUXCLKDIVSEL  0x1000U      // Lock bit for AUXCLKDIVSEL
                                               // register
#define SYSCTL_CLKCFGLOCK1_PERCLKDIVSEL  0x2000U      // Lock bit for PERCLKDIVSEL
                                               // register
#define SYSCTL_CLKCFGLOCK1_CLBCLKCTL  0x4000U      // Lock bit for CLBCLKCTL
                                               // register
#define SYSCTL_CLKCFGLOCK1_LOSPCP  0x8000U      // Lock bit for LOSPCP register
#define SYSCTL_CLKCFGLOCK1_XTALCR  0x10000U     // Lock bit for XTALCR register
#define SYSCTL_CLKCFGLOCK1_ETHERCATCLKCTL  0x20000U     // Lock bit for ETHERCATCLKCTL
                                               // register
#define SYSCTL_CLKCFGLOCK1_CMCLKCTL  0x40000U     // Lock bit for CMCLKCTL
                                               // register

//*****************************************************************************
//
// The following are defines for the bit fields in the CLKSRCCTL1 register
//
//*****************************************************************************
#define SYSCTL_CLKSRCCTL1_OSCCLKSRCSEL_S  0U
#define SYSCTL_CLKSRCCTL1_OSCCLKSRCSEL_M  0x3U         // OSCCLK Source Select Bit
#define SYSCTL_CLKSRCCTL1_INTOSC2OFF_NOTSUPPORTED  0x8U         // Internal Oscillator 2 Off Bit
#define SYSCTL_CLKSRCCTL1_XTALOFF  0x10U        // Crystal (External) Oscillator
                                               // Off Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CLKSRCCTL2 register
//
//*****************************************************************************
#define SYSCTL_CLKSRCCTL2_AUXOSCCLKSRCSEL_S  0U
#define SYSCTL_CLKSRCCTL2_AUXOSCCLKSRCSEL_M  0x3U         // AUXOSCCLK Source Select Bit
#define SYSCTL_CLKSRCCTL2_CANABCLKSEL_S  2U
#define SYSCTL_CLKSRCCTL2_CANABCLKSEL_M  0xCU         // CANA Clock Source Select Bit
#define SYSCTL_CLKSRCCTL2_CANBBCLKSEL_S  4U
#define SYSCTL_CLKSRCCTL2_CANBBCLKSEL_M  0x30U        // CANB Clock Source Select Bit
#define SYSCTL_CLKSRCCTL2_MCANABITCLKSEL_S  10U
#define SYSCTL_CLKSRCCTL2_MCANABITCLKSEL_M  0xC00U       // MCAN (global) Bit-Clock
                                               // Source Select Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CLKSRCCTL3 register
//
//*****************************************************************************
#define SYSCTL_CLKSRCCTL3_XCLKOUTSEL_S  0U
#define SYSCTL_CLKSRCCTL3_XCLKOUTSEL_M  0xFU         // XCLKOUT Source Select Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSPLLCTL1 register
//
//*****************************************************************************
#define SYSCTL_SYSPLLCTL1_PLLEN   0x1U         // SYSPLL enable/disable bit
#define SYSCTL_SYSPLLCTL1_PLLCLKEN  0x2U         // SYSPLL bypassed or included
                                               // in the PLLSYSCLK path

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSPLLMULT register
//
//*****************************************************************************
#define SYSCTL_SYSPLLMULT_IMULT_S  0U
#define SYSCTL_SYSPLLMULT_IMULT_M  0xFFU        // SYSPLL Integer Multiplier
#define SYSCTL_SYSPLLMULT_ODIV_S  16U
#define SYSCTL_SYSPLLMULT_ODIV_M  0x1F0000U    // Output Clock Divider
#define SYSCTL_SYSPLLMULT_REFDIV_S  24U
#define SYSCTL_SYSPLLMULT_REFDIV_M  0x1F000000U  // Reference Clock Divider

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSPLLSTS register
//
//*****************************************************************************
#define SYSCTL_SYSPLLSTS_LOCKS    0x1U         // SYSPLL Lock Status Bit
#define SYSCTL_SYSPLLSTS_SLIPS_NOTSUPPORTED  0x2U         // SYSPLL Slip Status Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the AUXPLLCTL1 register
//
//*****************************************************************************
#define SYSCTL_AUXPLLCTL1_PLLEN   0x1U         // AUXPLL enable/disable bit
#define SYSCTL_AUXPLLCTL1_PLLCLKEN  0x2U         // AUXPLL bypassed or included
                                               // in the AUXPLLCLK path

//*****************************************************************************
//
// The following are defines for the bit fields in the AUXPLLMULT register
//
//*****************************************************************************
#define SYSCTL_AUXPLLMULT_IMULT_S  0U
#define SYSCTL_AUXPLLMULT_IMULT_M  0xFFU        // AUXPLL Integer Multiplier
#define SYSCTL_AUXPLLMULT_ODIV_S  16U
#define SYSCTL_AUXPLLMULT_ODIV_M  0x1F0000U    // Output Clock Divider
#define SYSCTL_AUXPLLMULT_REFDIV_S  24U
#define SYSCTL_AUXPLLMULT_REFDIV_M  0x1F000000U  // Reference Clock Divider

//*****************************************************************************
//
// The following are defines for the bit fields in the AUXPLLSTS register
//
//*****************************************************************************
#define SYSCTL_AUXPLLSTS_LOCKS    0x1U         // AUXPLL Lock Status Bit
#define SYSCTL_AUXPLLSTS_SLIPS_NOTSUPPORTED  0x2U         // AUXPLL Slip Status Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCLKDIVSEL register
//
//*****************************************************************************
#define SYSCTL_SYSCLKDIVSEL_PLLSYSCLKDIV_S  0U
#define SYSCTL_SYSCLKDIVSEL_PLLSYSCLKDIV_M  0x3FU        // PLLSYSCLK Divide Select

//*****************************************************************************
//
// The following are defines for the bit fields in the AUXCLKDIVSEL register
//
//*****************************************************************************
#define SYSCTL_AUXCLKDIVSEL_AUXPLLDIV_S  0U
#define SYSCTL_AUXCLKDIVSEL_AUXPLLDIV_M  0x7U         // AUXPLLCLK Divide Select
#define SYSCTL_AUXCLKDIVSEL_MCANCLKDIV_S  8U
#define SYSCTL_AUXCLKDIVSEL_MCANCLKDIV_M  0x1F00U      // Divider between CANFD Source
                                               // Clock and CANFD Bit CLK

//*****************************************************************************
//
// The following are defines for the bit fields in the PERCLKDIVSEL register
//
//*****************************************************************************
#define SYSCTL_PERCLKDIVSEL_EPWMCLKDIV_S  0U
#define SYSCTL_PERCLKDIVSEL_EPWMCLKDIV_M  0x3U         // EPWM Clock Divide Select
#define SYSCTL_PERCLKDIVSEL_EMIF1CLKDIV  0x10U        // EMIF1  Clock Divide Select
#define SYSCTL_PERCLKDIVSEL_EMIF2CLKDIV  0x40U        // EMIF2 Clock Divide Select

//*****************************************************************************
//
// The following are defines for the bit fields in the XCLKOUTDIVSEL register
//
//*****************************************************************************
#define SYSCTL_XCLKOUTDIVSEL_XCLKOUTDIV_S  0U
#define SYSCTL_XCLKOUTDIVSEL_XCLKOUTDIV_M  0x3U         // XCLKOUT Divide Select

//*****************************************************************************
//
// The following are defines for the bit fields in the CLBCLKCTL register
//
//*****************************************************************************
#define SYSCTL_CLBCLKCTL_CLBCLKDIV_S  0U
#define SYSCTL_CLBCLKCTL_CLBCLKDIV_M  0x7U         // CLB clock divider
                                               // configuration.
#define SYSCTL_CLBCLKCTL_TILECLKDIV  0x10U        // CLB Tile clock divider
                                               // configuration.
#define SYSCTL_CLBCLKCTL_CLKMODECLB1  0x10000U     // Clock mode of CLB1
#define SYSCTL_CLBCLKCTL_CLKMODECLB2  0x20000U     // Clock mode of CLB2
#define SYSCTL_CLBCLKCTL_CLKMODECLB3  0x40000U     // Clock mode of CLB3
#define SYSCTL_CLBCLKCTL_CLKMODECLB4  0x80000U     // Clock mode of CLB4
#define SYSCTL_CLBCLKCTL_CLKMODECLB5  0x100000U    // Clock mode of CLB5
#define SYSCTL_CLBCLKCTL_CLKMODECLB6  0x200000U    // Clock mode of CLB6
#define SYSCTL_CLBCLKCTL_CLKMODECLB7  0x400000U    // Clock mode of CLB7
#define SYSCTL_CLBCLKCTL_CLKMODECLB8  0x800000U    // Clock mode of CLB8

//*****************************************************************************
//
// The following are defines for the bit fields in the LOSPCP register
//
//*****************************************************************************
#define SYSCTL_LOSPCP_LSPCLKDIV_S  0U
#define SYSCTL_LOSPCP_LSPCLKDIV_M  0x7U         // LSPCLK Divide Select

//*****************************************************************************
//
// The following are defines for the bit fields in the MCDCR register
//
//*****************************************************************************
#define SYSCTL_MCDCR_MCLKSTS      0x1U         // Missing Clock Status Bit
#define SYSCTL_MCDCR_MCLKCLR      0x2U         // Missing Clock Clear Bit
#define SYSCTL_MCDCR_MCLKOFF      0x4U         // Missing Clock Detect Off Bit
#define SYSCTL_MCDCR_OSCOFF       0x8U         // Oscillator Clock Off Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the X1CNT register
//
//*****************************************************************************
#define SYSCTL_X1CNT_X1CNT_S      0U
#define SYSCTL_X1CNT_X1CNT_M      0x3FFU       // X1 Counter
#define SYSCTL_X1CNT_CLR          0x10000U     // X1 Counter Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the XTALCR register
//
//*****************************************************************************
#define SYSCTL_XTALCR_OSCOFF      0x1U         // XTAL Oscillator powered-down
#define SYSCTL_XTALCR_SE          0x2U         // XTAL Oscilator in
                                               // Single-Ended mode

//*****************************************************************************
//
// The following are defines for the bit fields in the ETHERCATCLKCTL register
//
//*****************************************************************************
#define SYSCTL_ETHERCATCLKCTL_DIVSRCSEL  0x1U         // Clock source select for the
                                               // etherCAT clock divider.
#define SYSCTL_ETHERCATCLKCTL_ECATDIV_S  1U
#define SYSCTL_ETHERCATCLKCTL_ECATDIV_M  0xEU         // etherCAT clock divider
                                               // configuration.
#define SYSCTL_ETHERCATCLKCTL_PHYCLKEN  0x100U       // etherCAT PHY clock enable

//*****************************************************************************
//
// The following are defines for the bit fields in the CMCLKCTL register
//
//*****************************************************************************
#define SYSCTL_CMCLKCTL_CMDIVSRCSEL  0x1U         // Clock source select for the
                                               // CM clock divider.
#define SYSCTL_CMCLKCTL_CMCLKDIV_S  1U
#define SYSCTL_CMCLKCTL_CMCLKDIV_M  0xEU         // CM clock divider
                                               // configuration.
#define SYSCTL_CMCLKCTL_ETHDIVSRCSEL  0x10U        // Clock source select for the
                                               // etherNET clock divider.
#define SYSCTL_CMCLKCTL_ETHDIV_S  5U
#define SYSCTL_CMCLKCTL_ETHDIV_M  0xE0U        // Ethernet clock divider
                                               // configuration

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSYSLOCK1 register
//
//*****************************************************************************
#define SYSCTL_CPUSYSLOCK1_PIEVERRADDR  0x4U         // Lock bit for PIEVERRADDR
                                               // Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR0  0x8U         // Lock bit for PCLKCR0 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR1  0x10U        // Lock bit for PCLKCR1 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR2  0x20U        // Lock bit for PCLKCR2 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR3  0x40U        // Lock bit for PCLKCR3 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR4  0x80U        // Lock bit for PCLKCR4 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR6  0x200U       // Lock bit for PCLKCR6 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR7  0x400U       // Lock bit for PCLKCR7 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR8  0x800U       // Lock bit for PCLKCR8 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR9  0x1000U      // Lock bit for PCLKCR9 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR10  0x2000U      // Lock bit for PCLKCR10
                                               // Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR11  0x4000U      // Lock bit for PCLKCR11
                                               // Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR13  0x10000U     // Lock bit for PCLKCR13
                                               // Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR14  0x20000U     // Lock bit for PCLKCR14
                                               // Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR16  0x80000U     // Lock bit for PCLKCR16
                                               // Register
#define SYSCTL_CPUSYSLOCK1_LPMCR  0x200000U    // Lock bit for LPMCR Register
#define SYSCTL_CPUSYSLOCK1_GPIOLPMSEL0  0x400000U    // Lock bit for GPIOLPMSEL0
                                               // Register
#define SYSCTL_CPUSYSLOCK1_GPIOLPMSEL1  0x800000U    // Lock bit for GPIOLPMSEL1
                                               // Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR17  0x1000000U   // Lock bit for PCLKCR17
                                               // Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR18  0x2000000U   // Lock bit for PCLKCR18
                                               // Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR20  0x8000000U   // Lock bit for PCLKCR20
                                               // Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR21  0x10000000U  // Lock bit for PCLKCR21
                                               // Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR22  0x20000000U  // Lock bit for PCLKCR22
                                               // Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR23  0x40000000U  // Lock bit for PCLKCR23
                                               // Register

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSYSLOCK2 register
//
//*****************************************************************************
#define SYSCTL_CPUSYSLOCK2_ETHERCATCTL  0x1U         // Lock bit for ETHERCATCTL
                                               // register

//*****************************************************************************
//
// The following are defines for the bit fields in the PIEVERRADDR register
//
//*****************************************************************************
#define SYSCTL_PIEVERRADDR_ADDR_S  0U
#define SYSCTL_PIEVERRADDR_ADDR_M  0x3FFFFFU    // PIE Vector Fetch Error
                                               // Handler Routine Address

//*****************************************************************************
//
// The following are defines for the bit fields in the PCLKCR0 register
//
//*****************************************************************************
#define SYSCTL_PCLKCR0_CLA1       0x1U         // CLA1 Clock Enable Bit
#define SYSCTL_PCLKCR0_DMA        0x4U         // DMA Clock Enable bit
#define SYSCTL_PCLKCR0_CPUTIMER0  0x8U         // CPUTIMER0 Clock Enable bit
#define SYSCTL_PCLKCR0_CPUTIMER1  0x10U        // CPUTIMER1 Clock Enable bit
#define SYSCTL_PCLKCR0_CPUTIMER2  0x20U        // CPUTIMER2 Clock Enable bit
#define SYSCTL_PCLKCR0_CPUBGCRC   0x2000U      // CPUBGCRC Clock Enable Bit
#define SYSCTL_PCLKCR0_CLA1BGCRC  0x4000U      // CLA1BGCRC Clock Enable Bit
#define SYSCTL_PCLKCR0_HRCAL      0x10000U     // HRCAL Clock Enable Bit
#define SYSCTL_PCLKCR0_TBCLKSYNC  0x40000U     // EPWM Time Base Clock sync
#define SYSCTL_PCLKCR0_GTBCLKSYNC  0x80000U     // EPWM Time Base Clock Global
                                               // sync
#define SYSCTL_PCLKCR0_ERAD       0x1000000U   // ERAD module clock enable

//*****************************************************************************
//
// The following are defines for the bit fields in the PCLKCR1 register
//
//*****************************************************************************
#define SYSCTL_PCLKCR1_EMIF1      0x1U         // EMIF1 Clock Enable bit
#define SYSCTL_PCLKCR1_EMIF2      0x2U         // EMIF2 Clock Enable bit

