maxboss10086/max_dsp/max/F28388D/clb_pwm/device/driverlib/inc/hw_sysctl.h
//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL8 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL8_CAN_A      0x1U         // CAN_A CPU select bit
#define SYSCTL_CPUSEL8_CAN_B      0x2U         // CAN_B CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL9 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL9_MCBSP_A    0x1U         // McBSP_A CPU select bit
#define SYSCTL_CPUSEL9_MCBSP_B    0x2U         // McBSP_B CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL11 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL11_ADC_A     0x1U         // ADC_A CPU select bit
#define SYSCTL_CPUSEL11_ADC_B     0x2U         // ADC_B CPU select bit
#define SYSCTL_CPUSEL11_ADC_C     0x4U         // ADC_C CPU select bit
#define SYSCTL_CPUSEL11_ADC_D     0x8U         // ADC_D CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL12 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL12_CMPSS1    0x1U         // CMPSS1 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS2    0x2U         // CMPSS2 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS3    0x4U         // CMPSS3 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS4    0x8U         // CMPSS4 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS5    0x10U        // CMPSS5 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS6    0x20U        // CMPSS6 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS7    0x40U        // CMPSS7 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS8    0x80U        // CMPSS8 CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL14 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL14_DAC_A     0x10000U     // Buffered_DAC12_1 CPU select
                                               // bit
#define SYSCTL_CPUSEL14_DAC_B     0x20000U     // Buffered_DAC12_2 CPU select
                                               // bit
#define SYSCTL_CPUSEL14_DAC_C     0x40000U     // Buffered_DAC12_3 CPU select
                                               // bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL15 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL15_CLB1      0x1U         // CLB1 CPU select bit
#define SYSCTL_CPUSEL15_CLB2      0x2U         // CLB2 CPU select bit
#define SYSCTL_CPUSEL15_CLB3      0x4U         // CLB3 CPU select bit
#define SYSCTL_CPUSEL15_CLB4      0x8U         // CLB4 CPU select bit
#define SYSCTL_CPUSEL15_CLB5      0x10U        // CLB5 CPU select bit
#define SYSCTL_CPUSEL15_CLB6      0x20U        // CLB6 CPU select bit
#define SYSCTL_CPUSEL15_CLB7      0x40U        // CLB7 CPU select bit
#define SYSCTL_CPUSEL15_CLB8      0x80U        // CLB8 CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL16 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL16_FSITX_A   0x1U         // FSITX_A CPU select bit
#define SYSCTL_CPUSEL16_FSITX_B   0x2U         // FSITX_B CPU select bit
#define SYSCTL_CPUSEL16_FSIRX_A   0x10000U     // FSIRX_A CPU select bit
#define SYSCTL_CPUSEL16_FSIRX_B   0x20000U     // FSIRX_B CPU select bit
#define SYSCTL_CPUSEL16_FSIRX_C   0x40000U     // FSIRX_C CPU select bit
#define SYSCTL_CPUSEL16_FSIRX_D   0x80000U     // FSIRX_D CPU select bit
#define SYSCTL_CPUSEL16_FSIRX_E   0x100000U    // FSIRX_E CPU select bit
#define SYSCTL_CPUSEL16_FSIRX_F   0x200000U    // FSIRX_F CPU select bit
#define SYSCTL_CPUSEL16_FSIRX_G   0x400000U    // FSIRX_G CPU select bit
#define SYSCTL_CPUSEL16_FSIRX_H   0x800000U    // FSIRX_H CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL18 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL18_PMBUS_A   0x1U         // PMBUS_A CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL25 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL25_HRCAL_A   0x1U         // HRCAL CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPU2RESCTL register
//
//*****************************************************************************
#define SYSCTL_CPU2RESCTL_RESET   0x1U         // CPU2 Reset Control bit
#define SYSCTL_CPU2RESCTL_KEY_S   16U
#define SYSCTL_CPU2RESCTL_KEY_M   0xFFFF0000U  // Key Qualifier for writes to
                                               // this register

//*****************************************************************************
//
// The following are defines for the bit fields in the RSTSTAT register
//
//*****************************************************************************
#define SYSCTL_RSTSTAT_CPU2RES    0x1U         // CPU2 Reset Status bit
#define SYSCTL_RSTSTAT_CPU2NMIWDRST  0x2U         // Tells whether a CPU2.NMIWD
                                               // reset was issued to CPU2 or not
#define SYSCTL_RSTSTAT_CPU2HWBISTRST_S  2U
#define SYSCTL_RSTSTAT_CPU2HWBISTRST_M  0xCU         // Tells whether a HWBIST reset
                                               // was issued to CPU2 or not

//*****************************************************************************
//
// The following are defines for the bit fields in the LPMSTAT register
//
//*****************************************************************************
#define SYSCTL_LPMSTAT_CPU2LPMSTAT_S  0U
#define SYSCTL_LPMSTAT_CPU2LPMSTAT_M  0x3U         // CPU2 LPM Status

//*****************************************************************************
//
// The following are defines for the bit fields in the BANKSEL register
//
//*****************************************************************************
#define SYSCTL_BANKSEL_SEL_S      0U
#define SYSCTL_BANKSEL_SEL_M      0x3U         // Selects the BANK to be
                                               // programmed by CPU1 FMC.

//*****************************************************************************
//
// The following are defines for the bit fields in the USBTYPE register
//
//*****************************************************************************
#define SYSCTL_USBTYPE_TYPE_S     0U
#define SYSCTL_USBTYPE_TYPE_M     0x3U         // Configure USB type
#define SYSCTL_USBTYPE_LOCK       0x8000U      // Lock bit

//*****************************************************************************
//
// The following are defines for the bit fields in the ECAPTYPE register
//
//*****************************************************************************
#define SYSCTL_ECAPTYPE_TYPE_S    0U
#define SYSCTL_ECAPTYPE_TYPE_M    0x3U         // Configure ECAP type
#define SYSCTL_ECAPTYPE_LOCK      0x8000U      // Lock bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SDFMTYPE register
//
//*****************************************************************************
#define SYSCTL_SDFMTYPE_TYPE_S    0U
#define SYSCTL_SDFMTYPE_TYPE_M    0x3U         // Configure SDFM type
#define SYSCTL_SDFMTYPE_LOCK      0x8000U      // Lock bit

//*****************************************************************************
//
// The following are defines for the bit fields in the MEMMAPTYPE register
//
//*****************************************************************************
#define SYSCTL_MEMMAPTYPE_TYPE_S  0U
#define SYSCTL_MEMMAPTYPE_TYPE_M  0x3U         // Configures system specific
                                               // features related to memory map.
#define SYSCTL_MEMMAPTYPE_LOCK    0x8000U      // Lock bit

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCA_AC register
//
//*****************************************************************************
#define SYSCTL_ADCA_AC_CPUX_ACC_S  0U
#define SYSCTL_ADCA_AC_CPUX_ACC_M  0x3U         // CPU1 Access conditions to
                                               // peripheral
#define SYSCTL_ADCA_AC_CLA1_ACC_S  2U
#define SYSCTL_ADCA_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_ADCA_AC_DMA1_ACC_S  4U
#define SYSCTL_ADCA_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCB_AC register
//
//*****************************************************************************
#define SYSCTL_ADCB_AC_CPUX_ACC_S  0U
#define SYSCTL_ADCB_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_ADCB_AC_CLA1_ACC_S  2U
#define SYSCTL_ADCB_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_ADCB_AC_DMA1_ACC_S  4U
#define SYSCTL_ADCB_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCC_AC register
//
//*****************************************************************************
#define SYSCTL_ADCC_AC_CPUX_ACC_S  0U
#define SYSCTL_ADCC_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_ADCC_AC_CLA1_ACC_S  2U
#define SYSCTL_ADCC_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_ADCC_AC_DMA1_ACC_S  4U
#define SYSCTL_ADCC_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCD_AC register
//
//*****************************************************************************
#define SYSCTL_ADCD_AC_CPUX_ACC_S  0U
#define SYSCTL_ADCD_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_ADCD_AC_CLA1_ACC_S  2U
#define SYSCTL_ADCD_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_ADCD_AC_DMA1_ACC_S  4U
#define SYSCTL_ADCD_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPSS1_AC register
//
//*****************************************************************************
#define SYSCTL_CMPSS1_AC_CPUX_ACC_S  0U
#define SYSCTL_CMPSS1_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CMPSS1_AC_CLA1_ACC_S  2U
#define SYSCTL_CMPSS1_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_CMPSS1_AC_DMA1_ACC_S  4U
#define SYSCTL_CMPSS1_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPSS2_AC register
//
//*****************************************************************************
#define SYSCTL_CMPSS2_AC_CPUX_ACC_S  0U
#define SYSCTL_CMPSS2_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CMPSS2_AC_CLA1_ACC_S  2U
#define SYSCTL_CMPSS2_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_CMPSS2_AC_DMA1_ACC_S  4U
#define SYSCTL_CMPSS2_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPSS3_AC register
//
//*****************************************************************************
#define SYSCTL_CMPSS3_AC_CPUX_ACC_S  0U
#define SYSCTL_CMPSS3_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CMPSS3_AC_CLA1_ACC_S  2U
#define SYSCTL_CMPSS3_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_CMPSS3_AC_DMA1_ACC_S  4U
#define SYSCTL_CMPSS3_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPSS4_AC register
//
//*****************************************************************************
#define SYSCTL_CMPSS4_AC_CPUX_ACC_S  0U
#define SYSCTL_CMPSS4_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CMPSS4_AC_CLA1_ACC_S  2U
#define SYSCTL_CMPSS4_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_CMPSS4_AC_DMA1_ACC_S  4U
#define SYSCTL_CMPSS4_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPSS5_AC register
//
//*****************************************************************************
#define SYSCTL_CMPSS5_AC_CPUX_ACC_S  0U
#define SYSCTL_CMPSS5_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CMPSS5_AC_CLA1_ACC_S  2U
#define SYSCTL_CMPSS5_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_CMPSS5_AC_DMA1_ACC_S  4U
#define SYSCTL_CMPSS5_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPSS6_AC register
//
//*****************************************************************************
#define SYSCTL_CMPSS6_AC_CPUX_ACC_S  0U
#define SYSCTL_CMPSS6_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CMPSS6_AC_CLA1_ACC_S  2U
#define SYSCTL_CMPSS6_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_CMPSS6_AC_DMA1_ACC_S  4U
#define SYSCTL_CMPSS6_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPSS7_AC register
//
//*****************************************************************************
#define SYSCTL_CMPSS7_AC_CPUX_ACC_S  0U
#define SYSCTL_CMPSS7_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CMPSS7_AC_CLA1_ACC_S  2U
#define SYSCTL_CMPSS7_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_CMPSS7_AC_DMA1_ACC_S  4U
#define SYSCTL_CMPSS7_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPSS8_AC register
//
//*****************************************************************************
#define SYSCTL_CMPSS8_AC_CPUX_ACC_S  0U
#define SYSCTL_CMPSS8_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CMPSS8_AC_CLA1_ACC_S  2U
#define SYSCTL_CMPSS8_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_CMPSS8_AC_DMA1_ACC_S  4U
#define SYSCTL_CMPSS8_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the DACA_AC register
//
//*****************************************************************************
#define SYSCTL_DACA_AC_CPUX_ACC_S  0U
#define SYSCTL_DACA_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_DACA_AC_CLA1_ACC_S  2U
#define SYSCTL_DACA_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_DACA_AC_DMA1_ACC_S  4U
#define SYSCTL_DACA_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the DACB_AC register
//
//*****************************************************************************
#define SYSCTL_DACB_AC_CPUX_ACC_S  0U
#define SYSCTL_DACB_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_DACB_AC_CLA1_ACC_S  2U
#define SYSCTL_DACB_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_DACB_AC_DMA1_ACC_S  4U
#define SYSCTL_DACB_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the DACC_AC register
//
//*****************************************************************************
#define SYSCTL_DACC_AC_CPUX_ACC_S  0U
#define SYSCTL_DACC_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_DACC_AC_CLA1_ACC_S  2U
#define SYSCTL_DACC_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_DACC_AC_DMA1_ACC_S  4U
#define SYSCTL_DACC_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM1_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM1_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM1_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM1_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM1_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM1_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM1_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM2_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM2_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM2_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM2_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM2_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM2_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM2_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM3_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM3_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM3_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM3_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM3_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM3_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM3_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM4_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM4_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM4_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM4_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM4_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM4_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM4_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

