maxboss10086/max_dsp/max/F28388D/clb_pwm/device/driverlib/inc/hw_sysctl.h
//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM5_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM5_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM5_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM5_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM5_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM5_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM5_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM6_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM6_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM6_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM6_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM6_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM6_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM6_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM7_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM7_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM7_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM7_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM7_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM7_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM7_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM8_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM8_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM8_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM8_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM8_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM8_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM8_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM9_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM9_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM9_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM9_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM9_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM9_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM9_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM10_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM10_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM10_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM10_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM10_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM10_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM10_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM11_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM11_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM11_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM11_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM11_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM11_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM11_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM12_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM12_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM12_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM12_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM12_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM12_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM12_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM13_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM13_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM13_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM13_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM13_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM13_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM13_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM14_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM14_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM14_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM14_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM14_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM14_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM14_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM15_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM15_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM15_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM15_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM15_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM15_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM15_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWM16_AC register
//
//*****************************************************************************
#define SYSCTL_EPWM16_AC_CPUX_ACC_S  0U
#define SYSCTL_EPWM16_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EPWM16_AC_CLA1_ACC_S  2U
#define SYSCTL_EPWM16_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EPWM16_AC_DMA1_ACC_S  4U
#define SYSCTL_EPWM16_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EQEP1_AC register
//
//*****************************************************************************
#define SYSCTL_EQEP1_AC_CPUX_ACC_S  0U
#define SYSCTL_EQEP1_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EQEP1_AC_CLA1_ACC_S  2U
#define SYSCTL_EQEP1_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EQEP1_AC_DMA1_ACC_S  4U
#define SYSCTL_EQEP1_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EQEP2_AC register
//
//*****************************************************************************
#define SYSCTL_EQEP2_AC_CPUX_ACC_S  0U
#define SYSCTL_EQEP2_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EQEP2_AC_CLA1_ACC_S  2U
#define SYSCTL_EQEP2_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EQEP2_AC_DMA1_ACC_S  4U
#define SYSCTL_EQEP2_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the EQEP3_AC register
//
//*****************************************************************************
#define SYSCTL_EQEP3_AC_CPUX_ACC_S  0U
#define SYSCTL_EQEP3_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_EQEP3_AC_CLA1_ACC_S  2U
#define SYSCTL_EQEP3_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_EQEP3_AC_DMA1_ACC_S  4U
#define SYSCTL_EQEP3_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the ECAP1_AC register
//
//*****************************************************************************
#define SYSCTL_ECAP1_AC_CPUX_ACC_S  0U
#define SYSCTL_ECAP1_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_ECAP1_AC_CLA1_ACC_S  2U
#define SYSCTL_ECAP1_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_ECAP1_AC_DMA1_ACC_S  4U
#define SYSCTL_ECAP1_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the ECAP2_AC register
//
//*****************************************************************************
#define SYSCTL_ECAP2_AC_CPUX_ACC_S  0U
#define SYSCTL_ECAP2_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_ECAP2_AC_CLA1_ACC_S  2U
#define SYSCTL_ECAP2_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_ECAP2_AC_DMA1_ACC_S  4U
#define SYSCTL_ECAP2_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the ECAP3_AC register
//
//*****************************************************************************
#define SYSCTL_ECAP3_AC_CPUX_ACC_S  0U
#define SYSCTL_ECAP3_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_ECAP3_AC_CLA1_ACC_S  2U
#define SYSCTL_ECAP3_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_ECAP3_AC_DMA1_ACC_S  4U
#define SYSCTL_ECAP3_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the ECAP4_AC register
//
//*****************************************************************************
#define SYSCTL_ECAP4_AC_CPUX_ACC_S  0U
#define SYSCTL_ECAP4_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_ECAP4_AC_CLA1_ACC_S  2U
#define SYSCTL_ECAP4_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_ECAP4_AC_DMA1_ACC_S  4U
#define SYSCTL_ECAP4_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the ECAP5_AC register
//
//*****************************************************************************
#define SYSCTL_ECAP5_AC_CPUX_ACC_S  0U
#define SYSCTL_ECAP5_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_ECAP5_AC_CLA1_ACC_S  2U
#define SYSCTL_ECAP5_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_ECAP5_AC_DMA1_ACC_S  4U
#define SYSCTL_ECAP5_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the ECAP6_AC register
//
//*****************************************************************************
#define SYSCTL_ECAP6_AC_CPUX_ACC_S  0U
#define SYSCTL_ECAP6_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_ECAP6_AC_CLA1_ACC_S  2U
#define SYSCTL_ECAP6_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_ECAP6_AC_DMA1_ACC_S  4U
#define SYSCTL_ECAP6_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the ECAP7_AC register
//
//*****************************************************************************
#define SYSCTL_ECAP7_AC_CPUX_ACC_S  0U
#define SYSCTL_ECAP7_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_ECAP7_AC_CLA1_ACC_S  2U
#define SYSCTL_ECAP7_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_ECAP7_AC_DMA1_ACC_S  4U
#define SYSCTL_ECAP7_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the SDFM1_AC register
//
//*****************************************************************************
#define SYSCTL_SDFM1_AC_CPUX_ACC_S  0U
#define SYSCTL_SDFM1_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_SDFM1_AC_CLA1_ACC_S  2U
#define SYSCTL_SDFM1_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_SDFM1_AC_DMA1_ACC_S  4U
#define SYSCTL_SDFM1_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the SDFM2_AC register
//
//*****************************************************************************
#define SYSCTL_SDFM2_AC_CPUX_ACC_S  0U
#define SYSCTL_SDFM2_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_SDFM2_AC_CLA1_ACC_S  2U
#define SYSCTL_SDFM2_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_SDFM2_AC_DMA1_ACC_S  4U
#define SYSCTL_SDFM2_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB1_AC register
//
//*****************************************************************************
#define SYSCTL_CLB1_AC_CPUX_ACC_S  0U
#define SYSCTL_CLB1_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CLB1_AC_CLA1_ACC_S  2U
#define SYSCTL_CLB1_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB2_AC register
//
//*****************************************************************************
#define SYSCTL_CLB2_AC_CPUX_ACC_S  0U
#define SYSCTL_CLB2_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CLB2_AC_CLA1_ACC_S  2U
#define SYSCTL_CLB2_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB3_AC register
//
//*****************************************************************************
#define SYSCTL_CLB3_AC_CPUX_ACC_S  0U
#define SYSCTL_CLB3_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CLB3_AC_CLA1_ACC_S  2U
#define SYSCTL_CLB3_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB4_AC register
//
//*****************************************************************************
#define SYSCTL_CLB4_AC_CPUX_ACC_S  0U
#define SYSCTL_CLB4_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CLB4_AC_CLA1_ACC_S  2U
#define SYSCTL_CLB4_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB5_AC register
//
//*****************************************************************************
#define SYSCTL_CLB5_AC_CPUX_ACC_S  0U
#define SYSCTL_CLB5_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CLB5_AC_CLA1_ACC_S  2U
#define SYSCTL_CLB5_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB6_AC register
//
//*****************************************************************************
#define SYSCTL_CLB6_AC_CPUX_ACC_S  0U
#define SYSCTL_CLB6_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CLB6_AC_CLA1_ACC_S  2U
#define SYSCTL_CLB6_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB7_AC register
//
//*****************************************************************************
#define SYSCTL_CLB7_AC_CPUX_ACC_S  0U
#define SYSCTL_CLB7_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CLB7_AC_CLA1_ACC_S  2U
#define SYSCTL_CLB7_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB8_AC register
//
//*****************************************************************************
#define SYSCTL_CLB8_AC_CPUX_ACC_S  0U
#define SYSCTL_CLB8_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CLB8_AC_CLA1_ACC_S  2U
#define SYSCTL_CLB8_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral                                               
                                               
