maxboss10086/max_dsp/max/F28388D/clb_pwm/device/driverlib/inc/hw_sysctl.h
//*****************************************************************************
//
// The following are defines for the bit fields in the SPIA_AC register
//
//*****************************************************************************
#define SYSCTL_SPIA_AC_CPUX_ACC_S  0U
#define SYSCTL_SPIA_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_SPIA_AC_CLA1_ACC_S  2U
#define SYSCTL_SPIA_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_SPIA_AC_DMA1_ACC_S  4U
#define SYSCTL_SPIA_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the SPIB_AC register
//
//*****************************************************************************
#define SYSCTL_SPIB_AC_CPUX_ACC_S  0U
#define SYSCTL_SPIB_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_SPIB_AC_CLA1_ACC_S  2U
#define SYSCTL_SPIB_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_SPIB_AC_DMA1_ACC_S  4U
#define SYSCTL_SPIB_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the SPIC_AC register
//
//*****************************************************************************
#define SYSCTL_SPIC_AC_CPUX_ACC_S  0U
#define SYSCTL_SPIC_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_SPIC_AC_CLA1_ACC_S  2U
#define SYSCTL_SPIC_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_SPIC_AC_DMA1_ACC_S  4U
#define SYSCTL_SPIC_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the SPID_AC register
//
//*****************************************************************************
#define SYSCTL_SPID_AC_CPUX_ACC_S  0U
#define SYSCTL_SPID_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_SPID_AC_CLA1_ACC_S  2U
#define SYSCTL_SPID_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_SPID_AC_DMA1_ACC_S  4U
#define SYSCTL_SPID_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the PMBUS_A_AC register
//
//*****************************************************************************
#define SYSCTL_PMBUS_A_AC_CPUX_ACC_S  0U
#define SYSCTL_PMBUS_A_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_PMBUS_A_AC_CLA1_ACC_S  2U
#define SYSCTL_PMBUS_A_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_PMBUS_A_AC_DMA1_ACC_S  4U
#define SYSCTL_PMBUS_A_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_A_AC register
//
//*****************************************************************************
#define SYSCTL_CAN_A_AC_CPUX_ACC_S  0U
#define SYSCTL_CAN_A_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CAN_A_AC_DMA1_ACC_S  4U
#define SYSCTL_CAN_A_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_B_AC register
//
//*****************************************************************************
#define SYSCTL_CAN_B_AC_CPUX_ACC_S  0U
#define SYSCTL_CAN_B_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_CAN_B_AC_DMA1_ACC_S  4U
#define SYSCTL_CAN_B_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the MCBSPA_AC register
//
//*****************************************************************************
#define SYSCTL_MCBSPA_AC_CPUX_ACC_S  0U
#define SYSCTL_MCBSPA_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_MCBSPA_AC_CLA1_ACC_S  2U
#define SYSCTL_MCBSPA_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_MCBSPA_AC_DMA1_ACC_S  4U
#define SYSCTL_MCBSPA_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the MCBSPB_AC register
//
//*****************************************************************************
#define SYSCTL_MCBSPB_AC_CPUX_ACC_S  0U
#define SYSCTL_MCBSPB_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_MCBSPB_AC_CLA1_ACC_S  2U
#define SYSCTL_MCBSPB_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_MCBSPB_AC_DMA1_ACC_S  4U
#define SYSCTL_MCBSPB_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the USBA_AC register
//
//*****************************************************************************
#define SYSCTL_USBA_AC_CPUX_ACC_S  0U
#define SYSCTL_USBA_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_USBA_AC_DMA1_ACC_S  4U
#define SYSCTL_USBA_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the HRPWM_AC register
//
//*****************************************************************************
#define SYSCTL_HRPWM_AC_CPUX_ACC_S  0U
#define SYSCTL_HRPWM_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_HRPWM_AC_CLA1_ACC_S  2U
#define SYSCTL_HRPWM_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_HRPWM_AC_DMA1_ACC_S  4U
#define SYSCTL_HRPWM_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the ETHERCAT_AC register
//
//*****************************************************************************
#define SYSCTL_ETHERCAT_AC_CPU1_ACC_S  0U
#define SYSCTL_ETHERCAT_AC_CPU1_ACC_M  0x3U         // CPU1 Access conditions to
                                               // peripheral
#define SYSCTL_ETHERCAT_AC_DMA1_ACC_S  4U
#define SYSCTL_ETHERCAT_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the FSIATX_AC register
//
//*****************************************************************************
#define SYSCTL_FSIATX_AC_CPUX_ACC_S  0U
#define SYSCTL_FSIATX_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_FSIATX_AC_CLA1_ACC_S  2U
#define SYSCTL_FSIATX_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_FSIATX_AC_DMA1_ACC_S  4U
#define SYSCTL_FSIATX_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the FSIARX_AC register
//
//*****************************************************************************
#define SYSCTL_FSIARX_AC_CPUX_ACC_S  0U
#define SYSCTL_FSIARX_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_FSIARX_AC_CLA1_ACC_S  2U
#define SYSCTL_FSIARX_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_FSIARX_AC_DMA1_ACC_S  4U
#define SYSCTL_FSIARX_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the FSIBTX_AC register
//
//*****************************************************************************
#define SYSCTL_FSIBTX_AC_CPUX_ACC_S  0U
#define SYSCTL_FSIBTX_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_FSIBTX_AC_CLA1_ACC_S  2U
#define SYSCTL_FSIBTX_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_FSIBTX_AC_DMA1_ACC_S  4U
#define SYSCTL_FSIBTX_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the FSIBRX_AC register
//
//*****************************************************************************
#define SYSCTL_FSIBRX_AC_CPUX_ACC_S  0U
#define SYSCTL_FSIBRX_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_FSIBRX_AC_CLA1_ACC_S  2U
#define SYSCTL_FSIBRX_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_FSIBRX_AC_DMA1_ACC_S  4U
#define SYSCTL_FSIBRX_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the FSICRX_AC register
//
//*****************************************************************************
#define SYSCTL_FSICRX_AC_CPUX_ACC_S  0U
#define SYSCTL_FSICRX_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_FSICRX_AC_CLA1_ACC_S  2U
#define SYSCTL_FSICRX_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_FSICRX_AC_DMA1_ACC_S  4U
#define SYSCTL_FSICRX_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the FSIDRX_AC register
//
//*****************************************************************************
#define SYSCTL_FSIDRX_AC_CPUX_ACC_S  0U
#define SYSCTL_FSIDRX_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_FSIDRX_AC_CLA1_ACC_S  2U
#define SYSCTL_FSIDRX_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_FSIDRX_AC_DMA1_ACC_S  4U
#define SYSCTL_FSIDRX_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the FSIERX_AC register
//
//*****************************************************************************
#define SYSCTL_FSIERX_AC_CPUX_ACC_S  0U
#define SYSCTL_FSIERX_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_FSIERX_AC_CLA1_ACC_S  2U
#define SYSCTL_FSIERX_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_FSIERX_AC_DMA1_ACC_S  4U
#define SYSCTL_FSIERX_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the FSIFRX_AC register
//
//*****************************************************************************
#define SYSCTL_FSIFRX_AC_CPUX_ACC_S  0U
#define SYSCTL_FSIFRX_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_FSIFRX_AC_CLA1_ACC_S  2U
#define SYSCTL_FSIFRX_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_FSIFRX_AC_DMA1_ACC_S  4U
#define SYSCTL_FSIFRX_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the FSIGRX_AC register
//
//*****************************************************************************
#define SYSCTL_FSIGRX_AC_CPUX_ACC_S  0U
#define SYSCTL_FSIGRX_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_FSIGRX_AC_CLA1_ACC_S  2U
#define SYSCTL_FSIGRX_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_FSIGRX_AC_DMA1_ACC_S  4U
#define SYSCTL_FSIGRX_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the FSIHRX_AC register
//
//*****************************************************************************
#define SYSCTL_FSIHRX_AC_CPUX_ACC_S  0U
#define SYSCTL_FSIHRX_AC_CPUX_ACC_M  0x3U         // CPUx Access conditions to
                                               // peripheral
#define SYSCTL_FSIHRX_AC_CLA1_ACC_S  2U
#define SYSCTL_FSIHRX_AC_CLA1_ACC_M  0xCU         // CLA1 Access Conditions to
                                               // Peripheral
#define SYSCTL_FSIHRX_AC_DMA1_ACC_S  4U
#define SYSCTL_FSIHRX_AC_DMA1_ACC_M  0x30U        // DMA1 Access Conditions to
                                               // Peripheral

//*****************************************************************************
//
// The following are defines for the bit fields in the PERIPH_AC_LOCK register
//
//*****************************************************************************
#define SYSCTL_PERIPH_AC_LOCK_LOCK_AC_WR  0x1U         // Lock control for Access
                                               // control registers write.

//*****************************************************************************
//
// The following are defines for the bit fields in the CMRESCTL register
//
//*****************************************************************************
#define SYSCTL_CMRESCTL_RESET     0x1U         // Software reset to CM
#define SYSCTL_CMRESCTL_RESETSTS  0x2U         // CM Reset status
#define SYSCTL_CMRESCTL_KEY_S     16U
#define SYSCTL_CMRESCTL_KEY_M     0xFFFF0000U  // Key value

//*****************************************************************************
//
// The following are defines for the bit fields in the CMTOCPU1NMICTL register
//
//*****************************************************************************
#define SYSCTL_CMTOCPU1NMICTL_CMNMIWDRST  0x4U         // CMNMIWDRST NMI enable bit,
                                               // enables nmi generation to C28x

//*****************************************************************************
//
// The following are defines for the bit fields in the CMTOCPU1INTCTL register
//
//*****************************************************************************
#define SYSCTL_CMTOCPU1INTCTL_VECTRESET  0x1U         // VECTRESET Interrupt enable
                                               // bit, enables interrupt to C28x
#define SYSCTL_CMTOCPU1INTCTL_SYSRESETREQ  0x2U         // SYSRESETREQ Interrupt enable
                                               // bit, enables interrupt to C28x
#define SYSCTL_CMTOCPU1INTCTL_CMNMIWDRST  0x4U         // CMNMIWDRST Interrupt enable
                                               // bit, enables interrupt to C28x

//*****************************************************************************
//
// The following are defines for the bit fields in the PALLOCATE0 register
//
//*****************************************************************************
#define SYSCTL_PALLOCATE0_USB_A   0x1U         // Allocate USB_A to CM
#define SYSCTL_PALLOCATE0_ETHERCAT  0x2U         // Allocate ETHERCAT to CM
#define SYSCTL_PALLOCATE0_CAN_A   0x4U         // Allocate CANA to CM
#define SYSCTL_PALLOCATE0_CAN_B   0x8U         // Allocate CANB to CM

//*****************************************************************************
//
// The following are defines for the bit fields in the CM_CONF_REGS_LOCK register
//
//*****************************************************************************
#define SYSCTL_CM_CONF_REGS_LOCK_LOCK  0x1U         // Lock one time CM
                                               // configuration registers.

//*****************************************************************************
//
// The following are defines for the bit fields in the CM_STATUS_INT_FLG register
//
//*****************************************************************************
#define SYSCTL_CM_STATUS_INT_FLG_GINT  0x1U         // Global Interrupt flag
#define SYSCTL_CM_STATUS_INT_FLG_CMNMIWDRST  0x2U         // CMNMIWDRST caused a reset of
                                               // CM
#define SYSCTL_CM_STATUS_INT_FLG_CMSYSRESETREQ  0x4U         // CMSYSRESETREQ caused a reset
                                               // of CM
#define SYSCTL_CM_STATUS_INT_FLG_CMVECTRESET  0x8U         // CMVECTRESET caused a reset of
                                               // CM

//*****************************************************************************
//
// The following are defines for the bit fields in the CM_STATUS_INT_CLR register
//
//*****************************************************************************
#define SYSCTL_CM_STATUS_INT_CLR_GINT  0x1U         // Global Interrupt flag Clear
                                               // bit
#define SYSCTL_CM_STATUS_INT_CLR_CMNMIWDRST  0x2U         // CMNMIWDRST interrupt flag
                                               // clear bit
#define SYSCTL_CM_STATUS_INT_CLR_CMSYSRESETREQ  0x4U         // CMSYSRESETREQ interrupt flag
                                               // clear bit
#define SYSCTL_CM_STATUS_INT_CLR_CMVECTRESET  0x8U         // CMVECTRESET interrupt flag
                                               // clear bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CM_STATUS_INT_SET register
//
//*****************************************************************************
#define SYSCTL_CM_STATUS_INT_SET_CMNMIWDRST  0x2U         // CMNMIWDRST interrupt flag set
                                               // bit
#define SYSCTL_CM_STATUS_INT_SET_CMSYSRESETREQ  0x4U         // CMSYSRESETREQ interrupt flag
                                               // set bit
#define SYSCTL_CM_STATUS_INT_SET_CMVECTRESET  0x8U         // CMVECTRESET interrupt flag
                                               // set bit
#define SYSCTL_CM_STATUS_INT_SET_KEY_S  16U
#define SYSCTL_CM_STATUS_INT_SET_KEY_M  0xFFFF0000U  // KEY field

//*****************************************************************************
//
// The following are defines for the bit fields in the CM_STATUS_MASK register
//
//*****************************************************************************
#define SYSCTL_CM_STATUS_MASK_CMNMIWDRST  0x2U         // CMNMIWDRST flag mask bit
#define SYSCTL_CM_STATUS_MASK_CMSYSRESETREQ  0x4U         // CMSYSRESETREQ interrupt flag
                                               // set bit
#define SYSCTL_CM_STATUS_MASK_CMVECTRESET  0x8U         // CMVECTRESET interrupt flag
                                               // set bit
#define SYSCTL_CM_STATUS_MASK_KEY_S  16U
#define SYSCTL_CM_STATUS_MASK_KEY_M  0xFFFF0000U  // KEY field

//*****************************************************************************
//
// The following are defines for the bit fields in the SYS_ERR_INT_FLG register
//
//*****************************************************************************
#define SYSCTL_SYS_ERR_INT_FLG_GINT  0x1U         // Global Interrupt flag
#define SYSCTL_SYS_ERR_INT_FLG_EMIF_ERR  0x2U         // EMIF error event flag
#define SYSCTL_SYS_ERR_INT_FLG_RAM_CORRECTABLE_ERR  0x4U         // RAM correctable error flag
#define SYSCTL_SYS_ERR_INT_FLG_FLASH_CORRECTABLE_ERR  0x8U         // FLASH correctable error flag
#define SYSCTL_SYS_ERR_INT_FLG_RAM_ACC_VIOL  0x10U        // A RAM access vioation flag.
#define SYSCTL_SYS_ERR_INT_FLG_SYS_PLL_SLIP_NOTSUPPORTED  0x20U        // System PLL Slip event flag.
#define SYSCTL_SYS_ERR_INT_FLG_AUX_PLL_SLIP_NOTSUPPORTED  0x40U        // Auxillary PLL Slip event
                                               // flag.
#define SYSCTL_SYS_ERR_INT_FLG_DCC0  0x80U        // DCC0 Interrupt flag.
#define SYSCTL_SYS_ERR_INT_FLG_DCC1  0x100U       // DCC1 Interrupt flag.
#define SYSCTL_SYS_ERR_INT_FLG_DCC2  0x200U       // DCC2 Interrupt flag.

