maxboss10086/max_dsp/max/F28388D/clb_pwm/device/driverlib/inc/hw_sysctl.h
//*****************************************************************************
//
// The following are defines for the bit fields in the SYS_ERR_INT_CLR register
//
//*****************************************************************************
#define SYSCTL_SYS_ERR_INT_CLR_GINT  0x1U         // Global Interrupt flag Clear
                                               // bit
#define SYSCTL_SYS_ERR_INT_CLR_EMIF_ERR  0x2U         // EMIF_ERR interrupt flag clear
                                               // bit
#define SYSCTL_SYS_ERR_INT_CLR_RAM_CORRECTABLE_ERR  0x4U         // RAM_CORRECTABLE_ERR interrupt
                                               // flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_FLASH_CORRECTABLE_ERR  0x8U         // FLASH_CORRECTABLE_ERR
                                               // interrupt flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_RAM_ACC_VIOL  0x10U        // RAM_ACC_VIOL interrupt flag
                                               // clear bit
#define SYSCTL_SYS_ERR_INT_CLR_SYS_PLL_SLIP_NOTSUPPORTED  0x20U        // SYS_PLL_SLIP interrupt flag
                                               // clear bit
#define SYSCTL_SYS_ERR_INT_CLR_AUX_PLL_SLIP_NOTSUPPORTED  0x40U        // AUX_PLL_SLIP interrupt flag
                                               // clear bit
#define SYSCTL_SYS_ERR_INT_CLR_DCC0  0x80U        // DCC0 interrupt flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_DCC1  0x100U       // DCC1 interrupt flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_DCC2  0x200U       // DCC2 interrupt flag clear bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SYS_ERR_INT_SET register
//
//*****************************************************************************
#define SYSCTL_SYS_ERR_INT_SET_EMIF_ERR  0x2U         // Reserved
#define SYSCTL_SYS_ERR_INT_SET_RAM_CORRECTABLE_ERR  0x4U         // RAM_CORRECTABLE_ERR interrupt
                                               // flag set bit
#define SYSCTL_SYS_ERR_INT_SET_FLASH_CORRECTABLE_ERR  0x8U         // FLASH_CORRECTABLE_ERR
                                               // interrupt flag set bit
#define SYSCTL_SYS_ERR_INT_SET_RAM_ACC_VIOL  0x10U        // RAM_ACC_VIOL interrupt flag
                                               // set bit
#define SYSCTL_SYS_ERR_INT_SET_SYS_PLL_SLIP_NOTSUPPORTED  0x20U        // SYS_PLL_SLIP interrupt flag
                                               // set bit
#define SYSCTL_SYS_ERR_INT_SET_AUX_PLL_SLIP_NOTSUPPORTED  0x40U        // AUX_PLL_SLIP interrupt flag
                                               // set bit
#define SYSCTL_SYS_ERR_INT_SET_DCC0  0x80U        // DCC0 interrupt flag set bit
#define SYSCTL_SYS_ERR_INT_SET_DCC1  0x100U       // DCC1 interrupt flag set bit
#define SYSCTL_SYS_ERR_INT_SET_DCC2  0x200U       // DCC2 interrupt flag set bit
#define SYSCTL_SYS_ERR_INT_SET_KEY_S  16U
#define SYSCTL_SYS_ERR_INT_SET_KEY_M  0xFFFF0000U  // KEY field

//*****************************************************************************
//
// The following are defines for the bit fields in the SYS_ERR_MASK register
//
//*****************************************************************************
#define SYSCTL_SYS_ERR_MASK_EMIF_ERR  0x2U         // Reserved
#define SYSCTL_SYS_ERR_MASK_RAM_CORRECTABLE_ERR  0x4U         // RAM_CORRECTABLE_ERR flag mask
                                               // bit
#define SYSCTL_SYS_ERR_MASK_FLASH_CORRECTABLE_ERR  0x8U         // FLASH_CORRECTABLE_ERR flag
                                               // mask bit
#define SYSCTL_SYS_ERR_MASK_RAM_ACC_VIOL  0x10U        // RAM_ACC_VIOL flag mask bit
#define SYSCTL_SYS_ERR_MASK_SYS_PLL_SLIP  0x20U        // SYS_PLL_SLIP flag mask bit
#define SYSCTL_SYS_ERR_MASK_AUX_PLL_SLIP  0x40U        // AUX_PLL_SLIP flag mask bit
#define SYSCTL_SYS_ERR_MASK_DCC0  0x80U        // DCC0 flag mask bit
#define SYSCTL_SYS_ERR_MASK_DCC1  0x100U       // DCC1 flag mask bit
#define SYSCTL_SYS_ERR_MASK_DCC2  0x200U       // DCC2 flag mask bit
#define SYSCTL_SYS_ERR_MASK_KEY_S  16U
#define SYSCTL_SYS_ERR_MASK_KEY_M  0xFFFF0000U  // KEY field

//*****************************************************************************
//
// The following are defines for the bit fields in the SYNCSELECT register
//
//*****************************************************************************
#define SYSCTL_SYNCSELECT_SYNCOUT_S  24U
#define SYSCTL_SYNCSELECT_SYNCOUT_M  0x1F000000U  // Select Syncout Source

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOCOUTSELECT register
//
//*****************************************************************************
#define SYSCTL_ADCSOCOUTSELECT_PWM1SOCAEN  0x1U         // PWM1SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM2SOCAEN  0x2U         // PWM2SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM3SOCAEN  0x4U         // PWM3SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM4SOCAEN  0x8U         // PWM4SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM5SOCAEN  0x10U        // PWM5SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM6SOCAEN  0x20U        // PWM6SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM7SOCAEN  0x40U        // PWM7SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM8SOCAEN  0x80U        // PWM8SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM9SOCAEN  0x100U       // PWM9SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM10SOCAEN  0x200U       // PWM10SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM11SOCAEN  0x400U       // PWM11SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM12SOCAEN  0x800U       // PWM12SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM13SOCAEN  0x1000U      // PWM13SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM14SOCAEN  0x2000U      // PWM14SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM15SOCAEN  0x4000U      // PWM15SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM16SOCAEN  0x8000U      // PWM16SOCAEN Enable for
                                               // ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM1SOCBEN  0x10000U     // PWM1SOCBEN Enable for
                                               // ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM2SOCBEN  0x20000U     // PWM2SOCBEN Enable for
                                               // ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM3SOCBEN  0x40000U     // PWM3SOCBEN Enable for
                                               // ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM4SOCBEN  0x80000U     // PWM4SOCBEN Enable for
                                               // ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM5SOCBEN  0x100000U    // PWM5SOCBEN Enable for
                                               // ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM6SOCBEN  0x200000U    // PWM6SOCBEN Enable for
                                               // ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM7SOCBEN  0x400000U    // PWM7SOCBEN Enable for
                                               // ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM8SOCBEN  0x800000U    // PWM8SOCBEN Enable for
                                               // ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM9SOCBEN  0x1000000U   // PWM9SOCBEN Enable for
                                               // ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM10SOCBEN  0x2000000U   // PWM10SOCBEN Enable for
                                               // ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM11SOCBEN  0x4000000U   // PWM11SOCBEN Enable for
                                               // ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM12SOCBEN  0x8000000U   // PWM12SOCBEN Enable for
                                               // ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM13SOCBEN  0x10000000U  // PWM13SOCBEN Enable for
                                               // ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM14SOCBEN  0x20000000U  // PWM14SOCBEN Enable for
                                               // ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM15SOCBEN  0x40000000U  // PWM15SOCBEN Enable for
                                               // ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM16SOCBEN  0x80000000U  // PWM16SOCBEN Enable for
                                               // ADCSOCBOn

//*****************************************************************************
//
// The following are defines for the bit fields in the SYNCSOCLOCK register
//
//*****************************************************************************
#define SYSCTL_SYNCSOCLOCK_SYNCSELECT  0x1U         // SYNCSEL Register Lock bit
#define SYSCTL_SYNCSOCLOCK_ADCSOCOUTSELECT  0x2U         // ADCSOCOUTSELECT Register Lock
                                               // bit
#endif
